app/controllers/transactions_controller.rb

UPDATE "users" SET "braintree_id" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["braintree_id", "22216400"], ["updated_at", Sun, 11 Sep 2016 02:28:37 UTC +00:00]]
---
	def create
	  unless current_user.has_payment_info?
	    @result = Braintree::Transaction.sale(
	                amount: 10.00,
	                payment_method_nonce: params[:payment_method_nonce],
	                customer: {
	                  first_name: params[:first_name],
	                  last_name: params[:last_name],
	                  company: params[:company],
	                  email: current_user.email,
	                  phone: params[:phone]
	                },
	                options: {
	                  store_in_vault: true
	                })
	  else
	    @result = Braintree::Transaction.sale(
	                amount: 10.00,
	                payment_method_nonce: params[:payment_method_nonce])
	  end

	  if @result.success?
	    current_user.update(braintree_id: @result.transaction.customer_details.id) unless current_user.has_payment_info?