app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "user_number", "friend_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    user = User.new(user_params)
    if user.save

UPDATE "users" SET "wakeup_time" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["wakeup_time", Mon, 01 Jan 0700 08:00:00 UTC +00:00], ["updated_at", Sun, 11 Sep 2016 08:38:08 UTC +00:00]]
---
  def addTime
    if request.get?
      puts "THIS IS A GET REQUEST"
      param_time = "'" + params[:time].to_s  + "'"
      puts "time is #{param_time}"
      # puts param_time.class
      # wakeup_time = Time.parse(param_time)
      wakeup_time = DateTime.parse(param_time)
      puts "THIS IS THE WAKEUP TIME #{wakeup_time}"

      #Save to user
      current_user.wakeup_time = wakeup_time
      current_user.save